/**
 * 帮助中心－用户指南－用户服务协议
 **/
"use strict";

import url from "utils/Url";

var UserServiceAgreement = React.createClass({
  render() {
    return (
      <div className="userserviceagreement">
        <h3>用户服务协议</h3>
        <p className="frist-line">为使用惠商云的服务，您应当阅读并遵守《惠商云服务协议》（以下简称“本协议”）。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议。限制、免责条款可能以黑体加粗形式提示您注意。</p>
        <p>除非您已阅读并接受本协议所有条款，否则您无权使用惠商云提供的服务。您使用惠商云的服务即视为您已阅读并同意上述协议的约束。</p>
        <p>如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。</p>
        <h4>1.  协议范围</h4>
        <p>1.1  本协议是您与用友网络科技股份有限公司（以下简称“用友网络”）之间关于用户使用惠商云相关服务所订立的协议。“用友网络”是惠商云服务的运营单位。“用户”是指使用惠商云相关服务的使用人，在本协议中更多地称为“您”。</p>
        <p>1.2  本协议项下的服务是指惠商云向用户提供的包括但不限于微联、友联、电商通、数据云、畅联云、社区等产品及服务（以下简称“本服务”）。</p>
        <p>1.3  本协议内容同时包括《惠商云隐私权政策》和《惠商云知识产权声明》，且您在使用惠商云某一特定服务时，该服务可能会另有单独的协议、相关业务规则等（以下统称为“单独协议”）。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。您对前述任何业务规则、单独协议的接受，即视为您对本协议全部的接受。</p>
        <h4>2.  账号体系</h4>
        <p>2.1  作为有关服务的注册用户，您可以通过邮箱/手机获得账户。不要将您的帐户信息透露给任何其他人。您自行负责您帐户的保密和安全，并对您的帐户发生的或通过您的帐户发生的一切活动负全责，而且您同意将您的帐户出现的任何违反安全原则的情况立即通知用友网络。对于对您的帐户的擅自使用引起的任何损失，用友网络不承担任何责任。</p>
        <p>2.2  惠商云帐号的所有权归用友网络所有，用户完成申请注册手续后，仅获得惠商云帐号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖惠商云帐号或者以其他方式许可非初始申请注册人使用惠商云帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用惠商云账号。</p>
        <p>2.3  用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，您应立即通知用友网络。</p>
        <p>2.4  惠商云可能会不定期对用户身份进行确认，该确认行为不会单独另行通知，在确认期间，若您的账号未能通过确认，惠商云保留注销或冻结您的的权利。</p>
        <p>2.5  惠商云特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受盗号或密码失窃，责任由您自行承担。如果您忘记密码，或因其他原因而无法访问惠商云帐户，您可以通过访问重新设置密码网页http://mcloud.yonyou.com/portal/html/forgetpwd.html来恢复您的惠商云帐户。惠商云不保证您的惠商云帐户将能够还原，或者您的内容（请见第3条的定义）受到保护。</p>
        <h4>3.  用户内容</h4>
        <p>3.1  用户内容包括您上载到服务、存储在服务中，或通过服务传送的任何信息，如数据、文档、照片、视频、音乐、电子邮件和即时消息（下称“内容”）。我方不索求您在服务上提供的内容的所有权。您的内容仍是您的内容，您自行对其负责。此外，我方也不会控制、验证、担保您及他人在服务上提供的内容，或者为这些内容支付费用或对其承担任何责任。</p>
        <p>3.2  如果您在服务的公共区域共享内容，或者在您选出的其他人也能使用的共享区域中共享内容，那么这就表示，您同意与您共享内容的任何人可以免费使用、保存、复制、分发、显示和传输这些内容，只要他们在使用这些服务以及惠商云或其被许可方的其他产品和服务时涉及这些内容。如果您不希望其他人如此享用您的内容，请不要使用服务来共享您的内容。如果您使用或共享服务上的内容时，侵犯了他人的版权、商标、其他知识产权或隐私权，则视作您违反本协议。您表示并保证在本协议的有效期内，您拥有（并将一直拥有）您上载到服务或在服务上共享的内容的所有必要权利，并且对这些内容的使用（如本段落所详列）不会违反任何法律。</p>
        <p>3.3  在您将内容上载到服务时，您同意我方可以适当地使用、修改、改编、保存、复制、分发和显示这些内容，其适当程度应是为了保护您以及提供、保护和改进惠商云产品和服务而必需的程度。例如，我们有时可能会使用自动化的方法从电子邮件、聊天或照片中隔离信息，以帮助检测和防范垃圾邮件和恶意软件或者通过可使服务更易于使用的新功能改善服务。在处理您的内容时，惠商云将会采取相应的措施保护您的隐私。</p>
        <p>3.4  如果您的内容违反本协议或法律，我方会要求您从服务中删除这些内容。如不遵守，可能导致您丧失对服务或惠商云帐户的访问权，或者服务或惠商云帐户被取消。此外，如果我方断定您的内容确已违反本协议或法律，或者我方收到第三方发来的知识产权侵权投诉，惠商云可能直接删除您的内容，而无需征询您的意见。</p>
        <h4>4.  用户信息保护</h4>
        <p>4.1  您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。</p>
        <p>4.2  一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</p>
        <p>4.3  惠商云将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。</p>
        <p>4.4  惠商云不会将您的个人信息转移或披露给任何非关联的第三方，除非：</p>
        <p>4.4.1相关法律法规或法院、政府机关要求；</p>
        <p>4.4.2惠商云认为，为保证社会公众、惠商云的客户及员工的合法权益所必要且适当；</p>
        <p>4.4.3作为合并、收购、资产转让或类似交易的一部分而转移；或</p>
        <p>4.4.4为惠商云提供您要求的服务所必需。</p>
        <p>4.5  惠商云非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用惠商云的服务前，应事先取得您家长或法定监护人（以下简称"监护人"）的书面同意。</p>
        <p>4.6  惠商云的《隐私权政策》说明了惠商云如何收集和使用用户信息。您保证已经充分了解并同意惠商云可以据此处理用户信息。</p>
        <p>4.7  有关服务适用，如隐私权政策中所述，当您使用有关服务（例如：邀请其他用户加入有关服务、其他用户申请加入某个企业、参与社区时。），其他用户是可以看到您分享的个人信息的，而且他们/她们可以读取、采集或使用这些信息。对于您选择提交的个人信息，您应自行承担责任。</p>
        <p>4.8  用友网络有权但无义务监视由您提交的或可在有关服务上获得的任何材料，调查任何被报告的或明显的违反本协议行为，以及采取用友网络根据其自行判断认为适当的任何行动，包括但不限于根据本协议或根据我们的《知识产权声明》。</p>
        <h4>5.  知识产权条款</h4>
        <p>5.1  您同意，有关服务（包括但不限于图片、用户界面、声音素材、视频素材、编辑内容和安装有关服务所使用的脚本和软件）包含用友网络和/或其许可方拥有的专有信息和材料，受适用的知识产权法律和其他法律（包括但不限于著作权法律）的保护。您同意，您不会以任何方式使用该等专有信息或材料，但为了根据本协议使用有关服务的目的而使用的除外。除本协议条款明确允许的以外，不得以任何形式或任何方式复制有关服务的任何部分。您同意，不以任何方式修改、出租、租赁、出借、出售、分发有关服务，或以有关服务为基础创作衍生作品，并且您不得以任何未经授权的方式利用有关服务，包括但不限于侵占网络容量或使网络容量负荷过重。</p>
        <p>5.2  有关服务中的以及对有关服务的所有著作权（包括内容汇编、张贴、通往其他互联网资源的链接以及关于上述资源的描述）和相关软件的著作权，由用友网络和/或其许可方所有，用友网络和/或其许可方保留其在法律上的所有权利。除本协议中允许的对有关服务的使用外，对软件或有关服务的任何部分的使用均是严格禁止的，此等使用侵犯他人的知识产权，可能使您因侵犯著作权而受到民事和刑事处罚，包括可能支付损害赔偿金。</p>
        <p>5.3  惠商云、惠商云标识以及就有关服务使用的其他惠商云商标、服务标记、图形和标识是用友网络在中国和/或其他国家的商标或注册商标。就有关服务使用的其他商标、服务标记、图表和标识可能是其各自所有人的商标。未就任何上述商标或对上述商标的任何使用授予您任何权利或使用许可。</p>
        <p>5.4  惠商云在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权归用友网络所有，用户在使用本服务中所产生的内容的知识产权归用户或相关权利人所有。</p>
        <h4>6.  用户义务</h4>
        <p>6.1  您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限于：</p>
        <p>（1）发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、诽谤、淫秽、暴力以及任何违反国家法律法规的内容；</p>
        <p>（2）发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容；</p>
        <p>（3）恶意虚构事实、隐瞒真相以误导、欺骗他人；</p>
        <p>（4）发布、传送、传播广告信息及垃圾信息；</p>
        <p>（5）其他法律法规禁止的行为。</p>
        <p>6.2  如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制裁措施，并要求惠商云给予协助。造成损害的，您应依法予以赔偿，惠商云不承担任何责任。</p>
        <p>6.3  如果惠商云发现或收到他人举报您发布的信息违反本条约定，惠商云有权进行独立判断并采取技术手段予以删除、屏蔽或断开链接。同时，惠商云有权视用户的行为性质，采取包括但不限于暂停或终止服务，限制、冻结或终止惠商云号码使用，追究法律责任等措施。</p>
        <p>6.4  您违反本条约定，导致任何第三方损害的，您应当独立承担责任；惠商云因此遭受损失的，您也应当一并赔偿。</p>
        <p>6.5  您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。您应避免因使用本服务而使惠商云卷入政治和公共事件，否则惠商云有权暂停或终止对您的服务。</p>
        <h4>7.  免责条款</h4>
        <p>7.1  您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，惠商云将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失惠商云在法律允许的范围内免责。</p>
        <p>7.2  在法律允许的范围内，惠商云对以下情形导致的服务中断或受阻不承担责任：</p>
        <p>7.2.1  受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；</p>
        <p>7.2.2  用户或惠商云的电脑软件、系统、硬件和通信线路出现故障；</p>
        <p>7.2.3  用户操作不当；</p>
        <p>7.2.4  用户通过非惠商云授权的方式使用本服务；</p>
        <p>7.2.5  其他惠商云无法控制或合理预见的情形。</p>
        <p>7.3  您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，惠商云不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</p>
        <p>7.3.1来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；</p>
        <p>7.3.2 因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；</p>
        <p>7.3.3 其他因网络信息或用户行为引起的风险。</p>
        <p>7.4  您理解并同意，本服务并非为某些特定目的而设计，包括但不限于核设施、军事用途、医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，惠商云不承担法律责任。</p>
        <p>7.5  惠商云依据本协议约定获得处理违法违规内容的权利，该权利不构成惠商云的义务或承诺，惠商云不能保证及时发现违法行为或进行相应处理。</p>
        <p>7.6  在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意惠商云有关防范诈骗犯罪的提示。</p>
        <p>7.7  在任何情况下，用友网络、其董事、高级职员、雇员、关联公司、代理、承包商或许可方均不对由您对有关服务的使用或无法使用所引起的任何直接、间接、附带、惩罚性、特殊或后果性的损害赔偿或者在任何方面与您对有关服务的使用有关的权利主张（包括但不限于任何内容中的任何错误或遗漏、由于使用通过有关服务所张贴、传输或通过其他方式提供的任何内容（或有关产品）而发生的任何种类的任何损失或损害）承担责任，即使已被告知其可能性。由于某些司法管辖区不允许排除或限制对后果性或附带损害所承担的责任，因此，在该等司法管辖区内，用友网络的责任限制应以法律允许的为限。</p>
        <p>7.8  您已了解，您应自担服务使用风险，并且我方将按“现状”提供服务，服务“可能存在各种缺陷”且只提供“目前可用功能”。在您当地法律允许的范围内，我们排除有关适销性、质量满意保证、针对特定目的的适用性、无工艺问题和不侵权等方面的任何默示担保。根据您当地的法律，您可能享有某些权利。如果适用，本协议中的任何规定均无意影响这些权利。</p>
        <h4>8.  费用条款</h4>
        <p>8.1  惠商云的部分服务是以收费方式提供的，如您使用收费服务，请遵守相关的协议。惠商云可能根据实际需要对收费服务的收费标准、方式进行修改和变更，惠商云也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，惠商云将在相应服务页面进行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。</p>
        <p>8.2  除非另行约定，否则服务的规定价格不包括所有适用税款和货币结汇。您自行负责支付这种税费或其他费用。如果我方未准时从您收到所有款项，那么我们可能会暂停或取消服务。因未付款而暂停或取消服务可能会造成您无法访问和使用自己的帐户及其内容。</p>
        <p>8.3  退款政策。除非法律或特定服务优惠有相应规定，否则所有购买都是最终的，不可退款。</p>
        <p>8.4  如果服务不包括 Internet 访问，那么您负责向您的 Internet 访问服务提供商支付相应费用。这些费用并不包含在您向我方支付的服务费用之中。如果您通过无线设备（例如，移动电话和平板电脑）来访问服务，则您的无线运营商可能会针对警报、Web 浏览、消息传递以及其他需要使用空中和无线数据服务的服务收取费用。请向您的运营商核实是否会向您收取这种费用。您应独自负责承担因通过任何无线或其他通信服务访问该服务而发生的任何费用。</p>
        <h4>9.  服务变更、中断与终止</h4>
        <p>9.1  惠商云可能会对服务内容进行变更，也可能会中断、中止或终止服务。</p>
        <p>如发生下列任何一种情形，惠商云有权不经通知而中断或终止向您提供的服务：</p>
        <p>（1）根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；</p>
        <p>（2）您违反相关法律法规或本协议的约定；</p>
        <p>（3）按照法律规定或主管部门的要求；</p>
        <p>（4）出于安全的原因或其他必要的情形。</p>
        <p>9.2  惠商云有权按本协议第8条的约定进行收费。若您未按时足额付费，惠商云有权中断、中止或终止提供服务。</p>
        <p>9.3  您有责任自行备份存储在本服务中的数据。如果您的服务被终止，惠商云可以从服务器上永久地删除您的数据。服务终止后，惠商云没有义务向您返还数据。</p>
        <h4>10. 管辖与适用法律</h4>
        <p>10.1 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
        <p>10.2 本协议签订地为中华人民共和国北京市海淀区。</p>
        <p>10.3 若您和惠商云之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
        <p>10.4 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
        <p>10.5  本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
      </div>

    );
  }
});

module.exports = UserServiceAgreement;
