
"use strict";
var LegalDeclaration = React.createClass({
  render() {
    return (
      <div>
        <h3>法律声明</h3>
        <p> 1、您在本网站进行的所有行为应遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《全国人大常委会关于维护互联网安全的决定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》和《信息网络传播权保护条例》 等有关计算机互联网和知识产权的法律法规、实施办法。</p>
        <p> 2、用户承诺对其发表或者上传于本网站的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、 电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成用友被第三人索赔的，用户应承担因此所致用友所发生的一切损失及费用(包括但不限于各种补偿费、诉讼代理费及为此支出的其它合理费用)；</p>
        <p> 3、当第三方认为用户发表或者上传于本网站的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本网站发送权利通知书时，用户同意用友可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，用友将不会自动恢复上述删除的信息。</p>
        <h4> 惠商云隐私权政策</h4>
        <p>一、 收集的信息</p>
        <p>我们有两种信息收集方式：</p>
        <p>1. 您向我们提供的信息。例如，我们的很多服务都要求您注册惠商云帐户，而当您注册惠商云帐户时，我们会要求您提供个人信息，例如您的姓名、电子邮件地址、电话号码或信用卡号。如果您想充分利用我们提供的各种分享功能，可能还需要创建公开显示的惠商云个人资料，其中可能会包含您的姓名和照片。</p>
        <p>2. 我们在您使用服务的过程中获取的信息。我们会收集关于您使用的服务以及使用方式的信息，例如您在访问使用了我们的广告服务的网站或者查看我们的广告和内容并与之互动时的相关信息。</p>
        <p>二、 信息的种类</p>
        <p>1. 设备信息</p>
        <p>我们可能会收集设备专用的信息（例如您的硬件型号、操作系统版本、唯一设备标识符以及包括电话号码在内的移动网络信息）。惠商云可能会将您的设备标识符或电话号码与您的惠商云帐户相关联。</p>
        <p>2. 日志信息</p>
        <p>当您使用我们的服务或查看由惠商云提供的内容时，我们可能会自动收集某些信息并存储到服务器日志中。此类信息包括：</p>
        <p>2.1您对我们服务的详细使用情况，例如您的搜索查询内容。</p>
        <p>2.2 电话日志信息，例如您的电话号码、主叫方号码、呼叫转移号码、通话时间和日期、通话时长、短信路由信息以及通话类型。</p>
        3.  IP地址<p></p>
        <p>3.1  设备事件信息，例如崩溃、系统活动、硬件设置、浏览器类型、浏览器语言、您提出请求的日期和时间以及引荐网址。</p>
        <p>3.2  可唯一标识您的浏览器或惠商云帐户的Cookie。</p>
        <p>4.位置信息</p>
        当您使用启用了定位功能的惠商云服务时，我们可能会收集并处理有关您实际所在位置的信息（例如移动设备发送的GPS信号）。我们还可能使用各种技术进行定位，例如来自您设备的传感器数据就可以提供附近Wi-Fi接入点和基站的信息。<p></p>
        <p>5. 唯一应用程序编号</p>
        某些服务包含唯一应用程序编号。当您安装或卸载相关服务或当这些服务定期与我们的服务器通信（例如对软件进行自动更新）时，系统会将此编号以及与安装相关的信息（例如操作系统类型和应用程序版本号）发送给惠商云。<p></p>
        <p>6. 本地存储</p>
        <p>7. 我们可能会使用浏览器网络存储等机制（包括HTML5）和应用数据缓存，收集您设备上的信息（包括个人信息）并进行本地存储。</p>
        <p>8. Cookie 和匿名标识符</p>
        当您访问惠商云服务时，我们与合作伙伴会采用各种技术来收集和存储信息，在此过程中可能会向您的设备发送一个或多个Cookie或者匿名标识符。当您与我们提供给合作伙伴的服务（例如广告服务或可能显示在其他网站上的惠商云功能）进行互动时，我们也会使用Cookie和匿名标识符。<p></p>
        <p>三、 信息的使用</p>
        <p>1. 我们会利用从所有服务中收集到的信息来提供、维护、保护和完善这些服务，同时开发新的服务并保护惠商云和惠商云用户。我们还会使用此类信息为您提供定制内容，例如相关程度更高的搜索结果和广告。</p>
        <p>2. 对于我们提供的所有需要惠商云帐户的服务，我们都可能会使用您在惠商云个人资料中提供的姓名。此外，我们还会替换掉之前与您的惠商云帐户相关联的姓名，以确保您在我们的所有服务中采用同一个身份。如果其他用户知道您的电子邮件地址或其他能够识别您身份的信息，我们就会向他们显示您的惠商云个人资料公开信息，例如您的姓名和照片。</p>
        <p>3. 当您与惠商云联系时，我们会保存您的通信记录，这有助于解决您可能遇到的任何问题。我们会向您的电子邮件地址发送有关我们的服务的邮件，例如告知您即将进行的变更或改进。</p>
        <p>4. 我们会使用通过Cookie和其他技术（例如像素标签）收集到的信息，用来提升您的用户体验，并提高我们的整体服务质量。例如，通过保存您的语言偏好设置，我们就可以使用您的首选语言来显示我们的服务。此外，向您显示定制广告时，我们不会将Cookie或匿名标识符与敏感类别（例如基于种族、宗教、性取向或健康状况而划分的类别）相关联。</p>
        <p>5. 我们可能会将来自某项服务的个人信息与来自其他用友网络服务的信息（包括个人信息）结合起来，为了简化分享流程，方便您与相识的人分享信息。</p>
        <p>6. 当我们要将信息用于本隐私权政策未载明的其它用途时，则会事先征求您的同意。</p>
        <p>7. 用于处理个人信息的惠商云服务器遍布在全世界的许多国家/</p>地区。因此，我们处理您的个人信息时所用的服务器可能并不位于您所在的国家/地区。<p></p>
        <p>8. 惠商云可能会对产品使用情况进行统计。同时，惠商云可能会与公众分享这些统计信息，以展示我们服务的整体使用趋势。这些统计信息不包含您的任何身份识别信息。</p>
        <p>9. 在如下情况下，惠商云可能会披露您的信息：（1）事先获得您的授权；（2）您使用共享功能；（3）根据法律、法规、法律程序的要求或政府主管部门的强制性要求；（4）以学术研究或公共利益为目的；（5）为维护惠商云的合法权益，例如查找、预防、处理欺诈或安全方面的问题；（6）符合相关服务条款或使用协议的规定。</p>
        <p>10.  惠商云保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在惠商云的非公开内容。在不透露单个用户隐私资料的前提下，惠商云有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
        <p>四、 用户选择</p>
        <p>每个人对于隐私权的关注点各有不同，而我们的目标就是明确指出我们都收集哪些信息，以便您明智地选择其使用方式。例如，您可以：</p>
        <p>1. 通过用户管理，维护个人信息；</p>
        <p>2. 通过企业管理，维护企业信息；</p>
        <p>3. 通过角色管理，授予普通用户权限；</p>
        <p>4. 通过角色管理，授予应用管理员权限；</p>
        <p>5. 通过应用管理，授予应用使用权限</p>
        <p>五、 敏感信息</p>
        <p>在征得您的同意后，我们会与用友网络以外的公司、组织和个人分享您的个人信息。我们一定会征得您的同意才会共享任何敏感的个人信息，如与保密的就医情况、种族或民族、政治或宗教信仰或性倾向有关的信息。</p>
        <p>六、 信息安全</p>
        <p>1. 我们努力为惠商云用户提供保护，以免我们保存的信息在未经授权的情况下被访问、篡改、披露或破坏。为此，我们特别采取了以下措施：</p>
        <p>2. 我们会审查信息收集、存储和处理方面的做法（包括物理性安全措施），以避免各系统遭到未经授权的访问。</p>
        <p>3. 我们只允许那些为了帮我们处理个人信息而需要知晓这些信息的惠商云员工、承包商和代理商访问个人信息，而且他们需要履行严格的合同保密义务，如果其未能履行这些义务，就可能会被追究法律责任或被终止其与惠商云的关系。</p>
        <p>七、 适用范围</p>
        <p>我们的隐私权政策适用于由惠商云及其合作伙伴提供的所有服务。</p>
        <p>八、 信息监管</p>
        <p>我们会定期检查隐私权政策的遵守情况。此外，我们还遵循一些自我监管框架。我们收到正式的书面投诉后，会与投诉人联系，以便采取进一步行动。我们会与相应的监管机构（包括当地的数据保护机构）合作，以解决惠商云与用户之间无法直接解决的有关个人数据转让的投诉问题。</p>
        <p>九、 政策变更</p>
        <p>我们的隐私权政策随时都可能变更。未经您明确同意，我们不会削减您按照本隐私权政策所应享有的权利。我们会在本页面上发布对隐私权政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（包括对于某些服务，我们会通过电子邮件发送通知，说明隐私权政策的具体变更内容）。我们还会将本隐私权政策的旧版本存档，供您查阅。</p>
        <h4>惠商云知识产权声明</h4>
        <p>本知识产权声明是《惠商云用户协议》不可分割的组成部分，与《惠商云服务协议》、《惠商云隐私权政策》等构成一个统一的整体，您接受其中任一协议则代表您接受本《惠商云知识产权声明》。</p>
        <p>1. 用户权利</p>
        <p>1.1  对于用户通过惠商云服务（包括但不限于微联、友联、电商通、数据云、畅联云、社区等）上传到惠商云网站上可公开获取区域的任何内容，用户同意惠商云在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。</p>
        <p>1.2  您同意，您自己应对您提交或发布的任何内容负责，并且该等内容不得侵犯或违反任何其他方的权利或违反任何法律，不得涉及或鼓励侵权行为或其他非法行为，也不得是淫秽、低俗或恶俗的。您将该等内容提交或发布在公众或其他用户可访问的本服务区域内，即表示您声明，您是该等资料的所有人并且/或者您拥有分发该等资料的一切必要权利、许可和授权。</p>
        <p>2. 惠商云权利</p>
        <p>2.1  对于用户通过惠商云服务（包括但不限于微联、友联、电商通、数据云、畅联云、社区等）上传到惠商云网站上可公开获取区域的任何内容，用户同意惠商云在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中，而无需向您支付任何补偿也无需向您承担任何义务。</p>
        <p>2.2  惠商云为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。</p>
        <p>3. 软件许可</p>
        <p>3.1  用友网络授予您一项个人的、非专属、不可转让的有限许可，允许您根据本协议使用用友网络向您提供的作为本服务一部分的软件；前提是您不得（也不得允许其他人）对软件进行复制、修改、出租、出借、分发、创建衍生作品、反向工程、反编译或以其他方式试图找出源代码（除非法律明文允许或要求）、出售、租赁、再许可、转让或设置担保权益或以其他方式转移其中的任何权利，并且您不得以任何未经授权的方式过度利用本服务，包括但不限于侵占网络容量或使网络容量负荷过重。除本协议中允许的对本服务的使用外，对软件或本服务的任何部分的使用均是严格禁止的，此等使用侵犯他人的知识产权，可能使您因侵犯著作权而受到民事和刑事处罚，包括可能支付损害赔偿金。</p>
        <p>3.2  双方确认惠商云在本协议项下提供的系统软件和应用软件可能包括第三方软件，同时该第三方软件是惠商云通过与第三方供应商签订协议而取得合法使用权或著作权的软件。惠商云根据本协议授予您基于本协议目的实施的、非独占性、不得分许可、不得再分发的一般使用权。除本协议另有约定外，本协议项下所有软件的知识产权及所有权仍归惠商云或其相关第三方供应商所有。您不得删除、修改或掩藏任何第三方所提供产品中包含的任何版权、商标或其他专有权声明。</p>
        <p>4. 第三方权利</p>
        <p>4.1  有关服务中的以及对有关服务的所有著作权（包括内容汇编、张贴、通往其他互联网资源的链接以及关于上述资源的描述）和相关软件的著作权，由用友网络和/或其许可方所有，用友网络和/或其许可方保留其在法律上的所有权利。除本协议中允许的对有关服务的使用外，对软件或有关服务的任何部分的使用均是严格禁止的，此等使用侵犯他人的知识产权，可能使您因侵犯著作权而受到民事和刑事处罚，包括可能支付损害赔偿金。</p>
        <p>4.2  惠商云为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。</p>
        <p>4.3  用户应保证对在惠商云平台中发布、传送的内容享有完全知识产权，如系第三方作品，用户应当获得第三方的许可或未获得第三方许可但有权合法使用第三方作品。除法律法规另有规定外，未获得第三方作品所有人的事先许可，用户不得以任何方式使用第三方作品。如果惠商云收到任何第三方作品所有人或其合法代表发给惠商云的合理通知后，惠商云有权移除相应侵权作品。</p>
        <p>5. 免责条款</p>
        <p>5.1  可通过有关服务获得的某些内容和服务可能包括第三方的材料。用友网络可能为方便于您而提供通往第三方网站的链接。您同意，用友网络不负责检查或评估任何该等第三方材料或网站或第三方的任何其他材料、产品或服务的内容或准确性，并且，用友网络对此不作保证、不承担任何责任、也不负有任何义务。您同意，您将不会以侵犯或违反任何他方权利的方式使用任何第三方材料，而且用友网络不以任何方式为您的任何此等使用承担责任。</p>
        <p>5.2  对于从非惠商云指定站点下载的本软件产品以及从非惠商云发行的介质上获得的本软件产品，惠商云无法保证该软件是否感染计算机病毒、是否隐藏有伪装的特洛伊木马程序或者黑客软件，使用此类软件，将可能导致不可预测的风险，建议用户不要轻易下载、安装、使用，惠商云不承担任何由此产生的一切法律责任。</p>
        <p>5.3  任何经由惠商云提供的服务上传、发布、传送、存储的文档、图片、音乐、视频、应用程序或其它资料（以下简称“内容”），无论系公开还是私下传送，均由上传者承担责任。用户需独立对自己在本网站上实施的行为承担法律责任。</p>
        <p>5.4  用户若在惠商云平台上传、发布、传送、存储反动、色情、暴力等国家法律、行政法规禁止的内容及信息，惠商云平台的系统记录有可能作为用户违反法律的证据。因用户在惠商云平台的上传、发布、传送、存储上述内容而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户承担全部责任。</p>
        <p>6. 著作权通知与反通知</p>
        <p>6.1  如果您认为，您主张著作权的任何内容受到使用本服务的任何人的侵权，您可以联系我们用友网络的著作权代理人。用友网络可以暂停和/或终止被认定有屡次侵权行为的用户的帐户。</p>
        <p>6.2  如果惠商云收到权利人通知，主张您发送或传播的内容侵犯其相关权利的，您同意惠商云有权进行独立判断并采取删除、屏蔽或断开链接等措施。</p>
        <p>7. 当惠商云有理由相信您的内容侵害第三方权利或惠商云的权利时，您同意惠商云可以在第一时间内将该内容删除或屏蔽。</p>
      </div>
    );
  }
});

module.exports = LegalDeclaration;